---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineJunctionRiseType
source: html/df66c73c-b8f7-92ca-159a-f0debab34235.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineJunctionRiseType Property

Symbol for a 1 line junction rise

## Syntax (C#)
```csharp
public RiseDropSymbol SingleLineJunctionRiseType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input is not a valid piping rise/drop symbol type.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration